module.exports = {
  singleQuote: false, // Использовать двойные кавычки вместо одинарных
  semi: true, // Использовать точку с запятой в конце выражений
  trailingComma: 'all', // Добавлять запятые в конце последнего элемента в объектах, массивах и функциях
  printWidth: 120, // Максимальная ширина строки до переноса
  tabWidth: 2, // Количество пробелов на одну табуляцию
  arrowParens: 'always', // Всегда оборачивать параметры стрелочных функций в круглые скобки
  bracketSpacing: true, // Добавлять пробелы внутри фигурных скобок в объектах
};
